module.exports.channelsID = {
    welcome: `822528060196388926`,
    news: `837393627360788480`,
    commits: `837393666527985694`,
    /////////main[OOC]////////////
    main: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    voiceMain: `837397109463711744`,
    /////////Project Rules//////
    projectRules: `837395201726742528`,
    generalRules: `837395238360055879`,
    generalTerm: `837395471877013595`,
    /////////Lore///////////////
    lore: `837397940073922610`,
    generalLore: `837398017325269002`,
    /////////Team-General/////////////
    serverMsg: `838002676709064754`,
    logs: `838002959610675221`,
    bd: `838002825765322792`,
    admin_claim: `854322030714421258`
};

module.exports.BLChannelsID = {
    welcome: `822528060196388926`,
    devblog: `837393627360788480`,
    commits: `837393666527985694`,
    serverMsg: `838002676709064754`,
    logs: `838002959610675221`,
    bd: `838002825765322792`,
};

module.exports.discordTocens = {
    testBot: `ODQwMjMwNTMxNjYwNTEzMjgw.YJVLqQ.Lr7HGn01gH50OUcHrHr4Rl-BpSM`
};

module.exports.objects = [
    {
        name: 'Черчель-Стрит',
        radius: ['Черчель-Стрит 1',
                'Черчель-Стрит 2',
                'Черчель-Стрит 3',
                'Черчель-Стрит 4',
                'Черчель-Стрит 5, ПД',
                'Бродвей'],
        rooms: ['улица',
                'главная-площадь',
                'стена-славы-уличных-художников',
                'скейтпарк',]
    },
    {
        name: 'Черчель-Стрит 1',
        radius: ['Черчель-Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель-Стрит 2',
        radius: ['Черчель-Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель-Стрит 3',
        radius: ['Черчель-Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель-Стрит 4',
        radius: ['Черчель-Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель-Стрит 5, ПД',
        radius: ['Черчель-Стрит'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Черчель-Стрит 5, ПД, рабочая зона',
        radius: ['Черчель-Стрит 5, ПД'],
        rooms: ['комната-допроса',
                'комната-собраний',
                'медицинский-кабинет',
                'холл-перед-кпз']
    },
    {
        name: 'Черчель-Стрит 5, ПД, кабинет капитана',
        radius: ['Черчель-Стрит 5, ПД, рабочая зона'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель-Стрит 5, ПД, кпз',
        radius: ['Черчель-Стрит 5, ПД, рабочая зона'],
        rooms: ['холл',
                'камера-1',
                'камера-2',
                'камера-3',
                'камера-4']
    },

    {
        name: 'Бродвей',
        radius: ['Бродвей 1, 1 этаж',
                ''],
        rooms: ['улица',
                'главная-площадь',
                'стена-славы-уличных-художников',
                'скейтпарк',]
    },
];

module.exports.departments = {
    /* 1-id канала департамента.
    2-id сообщение базы данных департамента.
    3-id роли участника департамента. */
    police: [`855548786980683786`, `851070854259277855`, `851059230710693911`],
    med: [`852670972522921984`, `852671172960583731`, `852668829434904618`],
    fire: [`852671914149543946`, `852671239750156339`, `852669015838031874`],
    mayor: [`849732443426258953`, `852671196138831882`, `852668636481323009`],
};
