module.exports.channelsID = {
    welcome: `822528060196388926`,
    news: `837393627360788480`,
    commits: `837393666527985694`,
    announcements: `857727017045983232`,
    /////////verification////////////
    verification: `855871125753430016`,
    info: `855871075585753129`,
    ////////main[ooc]//////////
    main_ooc: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    voiceMain: `837397109463711744`,
    ////////main[rp]////////////
    main_rp: `855926428754509854`,
    help_info: `855873161090170901`,
    characters: `858323732686962710`,
    organization_and_formation: `858325435392983050`,
    adverts: `855926564226596865`,
    /////////Project Rules//////
    projectRules: `837395201726742528`,
    generalRules: `837395238360055879`,
    generalTerm: `837395471877013595`,
    /////////Lore///////////////
    fast_access: `837397940073922610`,
    generalLore: `837398017325269002`,
    /////////Team-Other/////////////
    team_other: `837393532808986625`,
    serverMsg: `838002676709064754`,
    logs: `838002959610675221`,
    rp_logs: `855781431023370270`,
    bd: `838002825765322792`,
    admin_claim: `854322030714421258`
};

module.exports.logChannels = {
    main: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    voiceMain: `837397109463711744`
};

module.exports.discordTocens = {
    testBot: `ODQwMjMwNTMxNjYwNTEzMjgw.YJVLqQ.Lr7HGn01gH50OUcHrHr4Rl-BpSM`
};

module.exports.objects = [
    {
        name: 'Черчель Стрит',
        radius: ['Бродвей',
                'Либерти',
                'Черчель Стрит 1',
                'Черчель Стрит 2',
                'Черчель Стрит 3',
                'Черчель Стрит 4',
                'Черчель Стрит 5 ПД',],
        rooms: ['улица',
                'главная-площадь',
                'стена-славы-уличных-художников',
                'скейтпарк',]
    },
    {
        name: 'Черчель Стрит 1',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 2',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 3',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 4',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 5 ПД',
        radius: ['Черчель Стрит',
                 'Черчель Стрит 5 ПД рабочая зона'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Черчель Стрит 5 ПД рабочая зона',
        radius: ['Черчель Стрит 5 ПД'],
        rooms: ['комната-допроса',
                'комната-собраний',
                'медицинский-кабинет',
                'холл-перед-кпз']
    },
    {
        name: 'Черчель Стрит 5 ПД комнаты экипировки',
        radius: ['Черчель Стрит 5 ПД рабочая зона'],
        rooms: ['экипировка-пожарных',
                'экипировка-полиции',
                'экипировка-медиков']
    },
    {
        name: 'Черчель Стрит 5 ПД кпз',
        radius: ['Черчель Стрит 5 ПД рабочая зона'],
        rooms: ['холл',
                'камера-1',
                'камера-2',
                'камера-3',
                'камера-4']
    },
    {
        name: 'Черчель Стрит 5 ПД кабинет капитана',
        radius: ['Черчель Стрит 5 ПД рабочая зона'],
        rooms: ['комната-1',
                'комната-2']
    },



    {
        name: 'Бродвей',
        radius: ['Черчель Стрит',
                'Бродвей парк',
                'Бродвей 1 1 этаж',
                'Бродвей площадка',
                'Бродвей 2 мэрия'],
        rooms: ['улица',
                'темный-закоулок',]
    },
    {
        name: 'Бродвей парк',
        radius: ['Бродвей',
                'Бродвей подземные пути'],
        rooms: ['парк-северная-часть',
                'парк-восточная-часть',
                'парк-южная-часть',
                'парк-западная-часть',]
    },
    {
        name: 'Бродвей подземные пути',
        radius: ['Бродвей парк',
                'Либерти 2 заброшка'],
        rooms: ['туннель',
                'большой-холл',
                'узкий-тупик',]
    },
    {
        name: 'Бродвей 1 1 этаж',
        radius: ['Бродвей',
                'Бродвей 1 1 этаж 1 кв',
                'Бродвей 1 1 этаж 2 кв',
                'Бродвей 1 1 этаж 3 кв',
                'Бродвей 1 2 этаж'],
        rooms: ['Бродвей-1-1-этаж']
    },
    {
        name: 'Бродвей 1 1 этаж 1 кв',
        radius: ['Бродвей 1 1 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',]
    },
    {
        name: 'Бродвей 1 1 этаж 2 кв',
        radius: ['Бродвей 1 1 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2',]
    },
    {
        name: 'Бродвей 1 1 этаж 3 кв',
        radius: ['Бродвей 1 1 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2',
                'комната-3',]
    },
    {
        name: 'Бродвей 1 2 этаж',
        radius: ['Бродвей 1 1 этаж',
                'Бродвей 1 2 этаж 4 кв',
                'Бродвей 1 2 этаж 5 кв'],
        rooms: ['Бродвей-1-2-этаж',
                'Бродвей-1-крыша']
    },
    {
        name: 'Бродвей 1 2 этаж 4 кв',
        radius: ['Бродвей 1 2 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1']
    },
    {
        name: 'Бродвей 1 2 этаж 5 кв',
        radius: ['Бродвей 1 2 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2']
    },
    {
        name: 'Бродвей площадка',
        radius: ['Бродвей',
                'Бродвей подземные пути'],
        rooms: ['турники-и-тренажеры',
                'футбольное-поле',
                'баскетбольное-поле']
    },
    {
        name: 'Бродвей 2 мэрия',
        radius: ['Бродвей'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Бродвей 2 мэрия персонал',
        radius: ['Бродвей 2 мэрия'],
        rooms: ['раздевалка',
                'офисы',
                'комната-отдыха']
    },
    {
        name: 'Бродвей 2 мэрия кабинет мэра',
        radius: ['Бродвей 2 мэрия персонал'],
        rooms: ['комната-1',
                'комната-2']
    },



    {
        name: 'Либерти',
        radius: ['Черчель Стрит',
                'Либерти 1',
                'Либерти 2 заброшка',
                'Либерти 3'],
        rooms: ['улица',
                'баскетбольная-площадка',
                'темный-закоулок']
    },
    {
        name: 'Либерти 1',
        radius: ['Либерти',
                'Либерти 1 1 кв',
                'Либерти 1 2 кв',
                'Либерти 1 3 кв',
                'Либерти 1 4 кв',],
        rooms: ['парадная',
                'кухня',
                'ванная']
    },
    {
        name: 'Либерти 1 1 кв',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Либерти 1 2 кв',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Либерти 1 3 кв',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Либерти 1 4 кв',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Либерти 2 заброшка',
        radius: ['Либерти',
                'Бродвей подземные пути'],
        rooms: ['главный-зал',
                'недостроенная-лестница',
                'место-со-сломанной-стеной']
    },
    {
        name: 'Либерти 3',
        radius: ['Либерти'],
        rooms: ['комната-1',
                'комната-2']
    },
];

module.exports.departments = {
    /* 1-id канала департамента.
    2-id сообщение базы данных департамента.
    3-id роли участника департамента. */
    fire: [`855786571394318336`, `852671239750156339`, `852669015838031874`],
    police: [`855786524306309130`, `851070854259277855`, `851059230710693911`],
    med: [`855786545939873792`, `852671172960583731`, `852668829434904618`],
    mayor: [`855582913268547696`, `852671196138831882`, `852668636481323009`],
};
