module.exports.channelsID = {
    welcome: `822528060196388926`,
    news: `837393627360788480`,
    commits: `837393666527985694`,
    announcements: `857727017045983232`,
    /////////verification////////////
    verification: `855871125753430016`,
    info: `855871075585753129`,
    ////////main[ooc]//////////
    main_ooc: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    voiceMain: `837397109463711744`,
    ////////main[rp]////////////
    main_rp: `855926428754509854`,
    help_info: `855873161090170901`,
    characters: `858323732686962710`,
    organization_and_formation: `858325435392983050`,
    adverts: `855926564226596865`,
    /////////Project Rules//////
    projectRules: `837395201726742528`,
    generalRules: `837395238360055879`,
    generalTerm: `837395471877013595`,
    /////////Lore///////////////
    fast_access: `859436063159091251`,
    /////////Team-Other/////////////
    team_other: `837393532808986625`,
    serverMsg: `838002676709064754`,
    logs: `838002959610675221`,
    rp_logs: `855781431023370270`,
    bd: `838002825765322792`,
    admin_claim: `854322030714421258`
};

module.exports.logChannels = {
    main: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    voiceMain: `837397109463711744`
};

module.exports.discordTocens = {
    testBot: `ODQwMjMwNTMxNjYwNTEzMjgw.YJVLqQ.Lr7HGn01gH50OUcHrHr4Rl-BpSM`
};

module.exports.objects = [
    {
        name: 'Черчель Стрит',
        radius: ['Бродвей',
                'Либерти',
                'Черчель Стрит 1',
                'Черчель Стрит 2',
                'Черчель Стрит 3',
                'Черчель Стрит 4',
                'Полицейский Департамент',],
        rooms: ['улица',
                'главная-площадь',
                'стена-славы-уличных-художников',
                'скейтпарк',]
    },
    {
        name: 'Черчель Стрит 1',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 2',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 3',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 4',
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Полицейский Департамент',
        radius: ['Черчель Стрит',
                 'Рабочая зона'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Рабочая зона',
        radius: ['Полицейский Департамент',
                 'Комнаты экипировки',
                 'КПЗ',
                 'Кабинет капитана'],
        rooms: ['комната-допроса',
                'комната-собраний',
                'медицинский-кабинет',
                'холл-перед-кпз']
    },
    {
        name: 'Комнаты экипировки',
        radius: ['Рабочая зона'],
        rooms: ['экипировка-пожарных',
                'экипировка-полиции',
                'экипировка-медиков']
    },
    {
        name: 'КПЗ',
        radius: ['Рабочая зона'],
        rooms: ['холл',
                'камера-1',
                'камера-2',
                'камера-3',
                'камера-4']
    },
    {
        name: 'Кабинет капитана',
        radius: ['Рабочая зона'],
        rooms: ['комната-1',
                'комната-2']
    },



    {
        name: 'Бродвей',
        radius: ['Черчель Стрит',
                'Парк',
                'Площадка',
                'Бродвей 1',
                'Мэрия'],
        rooms: ['улица',
                'темный-закоулок',]
    },
    {
        name: 'Парк',
        radius: ['Бродвей'],
        rooms: ['парк-северная-часть',
                'парк-восточная-часть',
                'парк-южная-часть',
                'парк-западная-часть',]
    },
    {
        name: 'Площадка',
        radius: ['Бродвей',
                'Подземные пути'],
        rooms: ['турники-и-тренажеры',
                'футбольное-поле',
                'баскетбольное-поле']
    },
    {
        name: 'Подземные пути',
        radius: ['Площадка',
                'Заброшка'],
        rooms: ['туннель',
                'большой-холл',
                'узкий-тупик',]
    },
    {
        name: 'Бродвей 1',
        radius: ['Бродвей',
                '1 квартира',
                '2 квартира',
                '3 квартира',
                '2 этаж'],
        rooms: ['этаж']
    },
    {
        name: '1 квартира',
        radius: ['Бродвей 1'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',]
    },
    {
        name: '2 квартира',
        radius: ['Бродвей 1'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2',]
    },
    {
        name: '3 квартира',
        radius: ['Бродвей 1'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2',
                'комната-3',]
    },
    {
        name: '2 этаж',
        radius: ['Бродвей 1',
                '4 квартира',
                '5 квартира'],
        rooms: ['этаж',
                'крыша']
    },
    {
        name: '4 квартира',
        radius: ['2 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1']
    },
    {
        name: '5 квартира',
        radius: ['2 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2']
    },
    {
        name: 'Мэрия',
        radius: ['Бродвей',
                'Комната персонала'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Комната персонала',
        radius: ['Мэрия',
                'Кабинет мэра'],
        rooms: ['раздевалка',
                'офисы',
                'комната-отдыха']
    },
    {
        name: 'Кабинет мэра',
        radius: ['Комната персонала'],
        rooms: ['комната-1',
                'комната-2']
    },



    {
        name: 'Либерти',
        radius: ['Черчель Стрит',
                'Либерти 1',
                'Заброшка',
                'Либерти 3'],
        rooms: ['улица',
                'баскетбольная-площадка',
                'темный-закоулок']
    },
    {
        name: 'Либерти 1',
        radius: ['Либерти',
                '1 квартира',
                '2 квартира',
                '3 квартира',
                '4 квартира',],
        rooms: ['парадная',
                'кухня',
                'ванная']
    },
    {
        name: '1 квартира',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: '2 квартира',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: '3 квартира',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: '4 квартира',
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Заброшка',
        radius: ['Либерти',
                'Подземные пути'],
        rooms: ['главный-зал',
                'недостроенная-лестница',
                'место-со-сломанной-стеной']
    },
    {
        name: 'Либерти 3',
        radius: ['Либерти'],
        rooms: ['комната-1',
                'комната-2']
    },
];

module.exports.departments = {
    /* 1-id канала департамента.
    2-id сообщение базы данных департамента.
    3-id роли участника департамента. */
    fire: [`855786571394318336`, `852671239750156339`, `852669015838031874`],
    police: [`855786524306309130`, `851070854259277855`, `851059230710693911`],
    med: [`855786545939873792`, `852671172960583731`, `852668829434904618`],
    mayor: [`855582913268547696`, `852671196138831882`, `852668636481323009`],
};
