module.exports.channelsID = {
    welcome: `822528060196388926`,
    news: `837393627360788480`,
    commits: `837393666527985694`,
    announcements: `857727017045983232`,
    /////////verification////////////
    verification: `855871125753430016`,
    info: `855871075585753129`,
    ////////main[ooc]//////////
    main_ooc: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    bot: `863733292158156810`,
    voiceMain: `837397109463711744`,
    ///////////nsfw///////////////
    nsfw: `871113954502508604`,
    nsfw_chat: `865905447764885544`,
    ////////main[rp]////////////
    main_rp: `855926428754509854`,
    help_info: `855873161090170901`,
    characters: `858323732686962710`,
    organization_and_formation: `858325435392983050`,
    adverts: `855926564226596865`,
    global_do: `860540156716515378`,
    /////////Project Rules//////
    projectRules: `837395201726742528`,
    generalRules: `837395238360055879`,
    generalTerm: `837395471877013595`,
    /////////Lore///////////////
    fast_access: `859436063159091251`,
    /////////Team-Other/////////////
    team_other: `837393532808986625`,
    serverMsg: `838002676709064754`,
    logs: `838002959610675221`,
    rp_logs: `855781431023370270`,
    bd: `838002825765322792`,
    admin_claim: `854322030714421258`
};

module.exports.logChannels = {
    main: `837393382229409823`,
    chatMain: `837393400121524259`,
    qa: `837393416202878989`,
    offers: `837393458435063886`,
    voiceMain: `837397109463711744`
};

module.exports.discordTocens = {
    main: `ODIyNTAwNDgzODI2NDUwNDU0.YFTLRA.-5ksrLJRwNPAEN_wFmQ2KSpl4rw`,
	testBot: `ODQwMjMwNTMxNjYwNTEzMjgw.YJVLqQ.Lr7HGn01gH50OUcHrHr4Rl-BpSM`
};

module.exports.globalObjects = [
	{
		name: 'Админ комната',
		id: '0',
        children: []
	},
	{
		name: 'Черчель Стрит',
		id: '1',
        children: []
	},
	{
		name: 'Бродвей',
		id: '2',
        children: ['Подземные пути']
	},
	{
		name: 'Либерти',
		id: '3',
        children: ['Заброшка']
	},
]

module.exports.objects = [

    //true - комната открыта.
    //false - комната закрыта.

    {
        name: 'Админ комната',
		id: '0',
        cId: '863436212261748766',
        open: false,
        radius: [],
        rooms: ['комната-1',
                'комната-2',
                'комната-3',
                'комната-4',]
    },


    {
        name: 'Черчель Стрит',
		id: '1',
        cId: '849709660579954748',
        open: true,
        radius: ['Бродвей',
                'Либерти',
                'Главная площадь',
                'Черчель Стрит 1',
                'Черчель Стрит 2',
                'Черчель Стрит 3',
                'Черчель Стрит 4',
                'Полицейский Департамент',],
        rooms: ['улица',
                'стена-славы-уличных-художников',
                'скейтпарк',]
    },
    {
        name: 'Главная площадь',
		id: '1',
        cId: '863422966498197524',
        open: true,
        radius: ['Черчель Стрит',],
        rooms: ['главная-площадь',
                'тир',
                'тележка-с-корн-догами',
                'тележка-с-сувенирами',
                'тележка-попкорна-и-сладкой-ваты']
    },
    {
        name: 'Черчель Стрит 1',
		id: '1',
        cId: '854287113789243404',
        open: true,
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 2',
		id: '1',
        cId: '854287269069586442',
        open: true,
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 3',
		id: '1',
        cId: '854287698587680799',
        open: true,
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Черчель Стрит 4',
		id: '1',
        cId: '854287814807126057',
        open: true,
        radius: ['Черчель Стрит'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Полицейский Департамент',
		id: '1',
        cId: '854473350332416060',
        open: true,
        radius: ['Черчель Стрит',
                 'Рабочая зона'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Рабочая зона',
		id: '1',
        cId: '854474407342899230',
        open: true,
        radius: ['Полицейский Департамент',
                 'Комнаты экипировки',
                 'КПЗ',
                 'Кабинет капитана'],
        rooms: ['комната-допроса',
                'комната-собраний',
                'медицинский-кабинет',
                'холл-перед-кпз']
    },
    {
        name: 'Комнаты экипировки',
		id: '1',
        cId: '855786364900606033',
        open: true,
        radius: ['Рабочая зона'],
        rooms: ['экипировка']
    },
    {
        name: 'КПЗ',
		id: '1',
        cId: '854490915052585000',
        open: true,
        radius: ['Рабочая зона'],
        rooms: ['холл',
                'камера-1',
                'камера-2',
                'камера-3',
                'камера-4']
    },
    {
        name: 'Кабинет капитана',
		id: '1',
        cId: '854474995244466176',
        open: true,
        radius: ['Рабочая зона'],
        rooms: ['комната-1',
                'комната-2']
    },



    {
        name: 'Бродвей',
		id: '2',
        cId: '849719912787738644',
        open: true,
        radius: ['Черчель Стрит',
                'Парк',
                'Площадка',
                'Бродвей 1',
                'Мэрия'],
        rooms: ['улица',
                'темный-закоулок',]
    },
    {
        name: 'Парк',
		id: '2',
        cId: '855555257144442930',
        open: true,
        radius: ['Бродвей'],
        rooms: ['парк-северная-часть',
                'парк-восточная-часть',
                'парк-южная-часть',
                'парк-западная-часть',]
    },
    {
        name: 'Площадка',
		id: '2',
        cId: '855554348608127027',
        open: true,
        radius: ['Бродвей',
                'Подземные пути'],
        rooms: ['турники-и-тренажеры',
                'футбольное-поле',
                'баскетбольное-поле']
    },
    {
        name: 'Подземные пути',
		id: '2',
        cId: '855553701480628245',
        open: true,
        radius: ['Площадка',
                'Заброшка'],
        rooms: ['туннель',
                'большой-холл',
                'узкий-тупик',]
    },
    {
        name: 'Бродвей 1',
		id: '2',
        cId: '854311139394453534',
        open: true,
        radius: ['Бродвей',
                '1 квартира',
                '2 квартира',
                '3 квартира',
                '2 этаж'],
        rooms: ['этаж']
    },
    {
        name: '1 квартира',
		id: '2',
        cId: '854468318899208252',
        open: true,
        radius: ['Бродвей 1'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',]
    },
    {
        name: '2 квартира',
		id: '2',
        cId: '854468450515943455',
        open: true,
        radius: ['Бродвей 1'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2',]
    },
    {
        name: '3 квартира',
		id: '2',
        cId: '854468463052193833',
        open: true,
        radius: ['Бродвей 1'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2',
                'комната-3',]
    },
    {
        name: '2 этаж',
		id: '2',
        cId: '854468897898364958',
        open: true,
        radius: ['Бродвей 1',
                '4 квартира',
                '5 квартира'],
        rooms: ['этаж',
                'крыша']
    },
    {
        name: '4 квартира',
		id: '2',
        cId: '854468477053304862',
        open: true,
        radius: ['2 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1']
    },
    {
        name: '5 квартира',
		id: '2',
        cId: '854468497311662100',
        open: true,
        radius: ['2 этаж'],
        rooms: ['прихожая',
                'ванная',
                'кухня',
                'комната-1',
                'комната-2']
    },
    {
        name: 'Мэрия',
		id: '2',
        cId: '854311242142056505',
        open: true,
        radius: ['Бродвей',
                'Комната персонала'],
        rooms: ['главный-холл',
                'приемная']
    },
    {
        name: 'Комната персонала',
		id: '2',
        cId: '855561716561870888',
        open: true,
        radius: ['Мэрия',
                'Кабинет мэра'],
        rooms: ['экипировка',
                'офисы',
                'комната-отдыха']
    },
    {
        name: 'Кабинет мэра',
		id: '2',
        cId: '854472885171388476',
        open: true,
        radius: ['Комната персонала'],
        rooms: ['комната-1',
                'комната-2']
    },



    {
        name: 'Либерти',
		id: '3',
        cId: '849732123166244964',
        open: true,
        radius: ['Черчель Стрит',
                'Либерти 1',
                'Заброшка',
                'Либерти 3'],
        rooms: ['улица',
                'баскетбольная-площадка',
                'темный-закоулок']
    },
    {
        name: 'Либерти 1',
		id: '3',
        cId: '854476843557978113',
        open: true,
        radius: ['Либерти',
                '1 квартира',
                '2 квартира',
                '3 квартира',
                '4 квартира',],
        rooms: ['парадная',
                'кухня',
                'ванная']
    },
    {
        name: '1 квартира',
		id: '3',
        cId: '854477821682122782',
        open: true,
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: '2 квартира',
		id: '3',
        cId: '854478018591326228',
        open: true,
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: '3 квартира',
		id: '3',
        cId: '854478135822909510',
        open: true,
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: '4 квартира',
		id: '3',
        cId: '854479036699902014',
        open: true,
        radius: ['Либерти 1'],
        rooms: ['комната-1',
                'комната-2']
    },
    {
        name: 'Заброшка',
		id: '3',
        cId: '854479240069513266',
        open: true,
        radius: ['Либерти',
                'Подземные пути'],
        rooms: ['главный-зал',
                'недостроенная-лестница',
                'место-со-сломанной-стеной']
    },
    {
        name: 'Либерти 3',
		id: '3',
        cId: '855584292485595166',
        open: true,
        radius: ['Либерти'],
        rooms: ['комната-1',
                'комната-2']
    },
];

module.exports.departments = {
    /* 1-id канала комнаты экипировки.
    2-id сообщение базы данных департамента.
    3-id роли участника департамента.
    4-название орги*/
    fire: [`855786524306309130`, `852671239750156339`, `852669015838031874`, 'Пожарный', 4],
    police: [`855786524306309130`, `851070854259277855`, `851059230710693911`, 'Полицейский', 1],
    med: [`855786524306309130`, `852671172960583731`, `852668829434904618`, 'Медик', 3],
    mayor: [`865591993547882556`, `852671196138831882`, `852668636481323009`, 'Сотрудник мэрии', 4],
    agents: [`865591993547882556`, `865591312762011661`, `865232599982800947`, 'Агент специальной службы', 2],
    fbi: [`855786524306309130`, `869587117456621568`, `869585565320904715`, 'ФБР агент', 2],
};
