module.exports.departments = {
    /* 1-id канала комнаты экипировки.
    2-id сообщение базы данных департамента.
    3-id роли участника департамента.
    4-название орги*/
    fire: [`855786524306309130`, `852671239750156339`, `852669015838031874`, 'Пожарный', 4],
    police: [`855786524306309130`, `851070854259277855`, `851059230710693911`, 'Полицейский', 1],
    med: [`855786524306309130`, `852671172960583731`, `852668829434904618`, 'Медик', 3],
    mayor: [`865591993547882556`, `852671196138831882`, `852668636481323009`, 'Сотрудник мэрии', 4],
    agents: [`865591993547882556`, `865591312762011661`, `865232599982800947`, 'Агент специальной службы', 2],
    fbi: [`855786524306309130`, `869587117456621568`, `869585565320904715`, 'ФБР агент', 2],
}